85hzc/ask_433/stm32f1_cube/Src/main.c
/* USER CODE END 0 */

void appInit(void)
{

    runFlag = 1;
    powerFlag = 1;

    //芯片配置相关参数
#if(PROJECTOR_OSRAM)
    eplosCfgFlag = 1;
    eplosSLPxen = DISABLE;
#endif
    //显示相关参数
    programsType = PHOTO;
    filmProgramIdx = 0;
    filmFrameIdx = 0;
    photoProgramIdx = 0;
    
    Drv_SERIAL_Init();
#if(PROJECTOR_OSRAM)
    Drv_FAN_Init();
#endif
}

void Drv_SERIAL_Proc(void)
{
    uint8_t *ptr;
    uint8_t key[16];

    //BLE mesh 8258/8269
    if(UsartType1.RX_flag)
    {
        UsartType1.RX_flag = 0;
        ptr = UsartType1.RX_pData;

        memset(key, 0, sizeof(key));
        strncpy(key,ptr,UsartType1.RX_Size);
        printf("rx len=%d\r\n",UsartType1.RX_Size);
        
        //UartDataHandle(rgbdata);
#if PROJECTOR_CUBE
        AppControlCubeHandle(key);
#elif(CUBEPLT_SLAVE)
        AppControlCubePltHandle(key, UsartType1.RX_Size);
#elif PROJECTOR_OSRAM
        AppControlEplosHandle(key);
#endif
        HAL_UART_Transmit(&DEBUG_UART, UsartType1.RX_pData, UsartType1.RX_Size, 0xffff);
    }

    //ble
    /*
    if(UsartType2.RX_flag)
    {
        UsartType2.RX_flag = 0;
        ptr = UsartType2.RX_pData;

        memset(key, 0, sizeof(key));
        strncpy(key,ptr,UsartType2.RX_Size);
        //HAL_UART_Transmit(&DEBUG_UART, UsartType2.RX_pData, UsartType2.RX_Size, 0xffff);
    }
    */
    
    //debug
    if(UsartType3.RX_flag)
    {
        UsartType3.RX_flag = 0;

        ptr = UsartType3.RX_pData;

        memset(key, 0, sizeof(key));
        strncpy(key,ptr,UsartType3.RX_Size);
        UartDebugControlHandle(key);
        /*
        if(key[0]==8)
        {
            HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
        }
        else if(key[0]==9)
        {
            HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
        }
        */
        //HAL_UART_Transmit(&DEBUG_UART, UsartType3.RX_pData, UsartType3.RX_Size, 0xffff);
    }

#if(CUBE_MASTER)
    if(usartTxFlag)
    {
        HAL_UART_Transmit(&huart1, usartTxData, sizeof(usartTxData), 0xffff);
        usartTxFlag = 0;
    }
    /*
#elif(CUBEPLT_MASTER)
    if(usartTxFlag)
    {
        HAL_UART_Transmit(&huart1, usartTxData, sizeof(usartTxData), 0xffff);
        usartTxFlag = 0;
    }*/
#endif

#if 0
    /* 1. read the uart buffer... */
    if (HAL_OK == Drv_SERIAL_Read(single_cmd, 0))
    {
        if (Drv_CMD_Handler(single_cmd) > 0)
        {
            if (CMD_HEADER_REQ == single_cmd[0])
            {
                single_cmd[0] = CMD_HEADER_RSP;
                Drv_SERIAL_Write(single_cmd, 0);
            }
        }
    }
#endif
    /* 2. read the action buffer... */
    if (HAL_OK == Drv_SERIAL_Read_Act(single_cmd))
    {
        //printf("Act location:0x%x 0x%x 0x%x 0x%x\r\n",
        //        single_cmd[0],single_cmd[1],single_cmd[2],single_cmd[3]);
        (void)Drv_CMD_Handler(single_cmd);
    }
}

int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();  //systick 1ms

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_TIM1_Init();//for PWM pulse

#if(IR_REMOTE)
    MX_TIM3_Init();//for IR INT
    /* Initialize IR state */
    Drv_IR_Init();
#endif

#ifdef SUPPORT_FATFS
#ifdef SPI_HARD
    SPI_Configuration();    //SPI初始化
#else
    SPI_GPIO_Soft_Init();
#endif
#endif
    appInit();
    printf("system start.\r\n");

#if 1
    HAL_UART_Receive_DMA(&huart1, UsartType1.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);

    HAL_UART_Receive_DMA(&huart2, UsartType2.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE);

    HAL_UART_Receive_DMA(&huart3, UsartType3.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart3, UART_IT_IDLE);
#else
    HAL_UART_Receive_IT(&huart1, rxData, 5);
#endif

    printf("system init hclk:%d\r\n",HAL_RCC_GetHCLKFreq());

#ifdef SUPPORT_FATFS
#ifdef SPI_HARD
    SD_Init();
#else
    SDInit();
#endif
    printf("SDInit ok!\r\n");
    //SD_ReadFileList("");
    //SD_ReadFileList("/f1");
    //SD_ReadFileList("/f2");
    //SD_fileCopy();           //测试函数
#endif

#if(PROJECTOR_OSRAM)
    I2C_init();
    SD_ReadPhotoFileList("/OSRAM/Photo");
    SD_ReadFilmFolderList("/OSRAM/Film");
    
    for(int i=0;i < filmTotalProgram; i++)
    {
        SD_ReadFilmFileList(i);
    }
#elif(PROJECTOR_CUBE)
    SD_ReadPhotoFileList("/WS2801/Photo");
    SD_ReadFilmFolderList("/WS2801/Film");
    
    for(int i=0;i < filmTotalProgram; i++)
    {
        SD_ReadFilmFileList(i);
    }
#elif(CUBEPLT_MASTER)
    //SD_ReadPhotoFileList("/CUBE/Photo");
    SD_ReadFilmFolderList("/CUBE/Film");
    
    for(int i=0;i < filmTotalProgram; i++)
    {
        SD_ReadFilmFileList(i);
    }
#endif

    printf("Files Ready!\r\n");

#if(PROJECTOR_MBI5124)
    //reg_config();
#endif
    while (1)
    {
#if(PROJECTOR_OSRAM)
        Drv_FAN_Proc();
#endif

#if(PROJECTOR_MBI5153)
        MBI5153_X();
        //MBI5153_play();
        //MBI5153_Sink();
#elif(PROJECTOR_MBI5124)
        if(scenMode==0)
            MBI5124_X();
        else if(scenMode==1)
            MBI5124_Sink();
        else if(scenMode==2)
            MBI5124_Play();
#elif(PROJECTOR_MCUGPIO)
        MCUGpio_X();
        //MCUGpio_Sink();
#elif(PROJECTOR_OSRAM)
        OSRAM_config();
        OSRAM_play();
        //Delay_ms(200);
        //EPLOS_status_read();
        //Delay_ms(200);
#elif(PROJECTOR_CUBE)
        WS2801_play();
#elif(PROJECTOR_CUBEPLT)
        CUBE_play();
#endif

        Drv_SERIAL_Proc();

/*
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
        Delay_ms(100);

        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
        Delay_ms(100);
*/
    }
}

