85hzc/ask_433/stm32f1_cube/Src/main.c
#if PROJECTOR_CUBE
void AppControlCubeHandle(uint8_t *key)
{
    uint16_t ttt;
    uint16_t IR_code = 0;
    uint8_t pId,fId;
    PROGRAMS_TYPE_E type;

    type = *key++;
    pId = *key++;
    fId = *key;

    printf("AppControlCubeHandle type:%d,pid:%d,fid:%d\r\n",type,pId,fId);

    switch(type)
    {
        case PHOTO:
            runFlag = 1;
            photoProgramIdx = pId;
            programsType = PHOTO;
            break;

        case FILM:
            runFlag = 1;
            filmProgramIdx = pId;
            filmFrameIdx = fId;
            programsType = FILM;
            break;

        default:
            break;
    }
}
#endif


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
